{"date": [10, 2024], "name": "October 2024 General Conference", "thumbnail": "https://www.churchofjesuschrist.org/imgs/s4c6koq1axflec6ni6s2kdoe50xv7lnhy3p1ckry/full/200%2C/0/default", "sessions": [{"name": "saturday-morning-session", "talks": [{"speaker": "Elder Neil L. Andersen", "img": "https://www.churchofjesuschrist.org/imgs/eeb6678a833511ef9b3a0626c361eb55d5d19cbc/full/!192%2C/0/default", "title": "The Triumph of Hope", "kicker": "Hope is a living gift, a gift that grows as we increase our faith in Jesus Christ.", "talkText": "\nMy dear brothers and sisters across the world, as we begin this very special time of general conference, the eyes of heaven will certainly be focused upon us. We will hear the voice of the Lord through His servants; we will feel the “guiding, directing, [and] comforting” influence of the Holy Ghost, and our faith will be strengthened.\nThree years ago, President Russell M. Nelson began general conference with these words: “Pure revelation for the questions in your heart will make this conference rewarding and unforgettable. If you have not yet sought for the ministering of the Holy Ghost to help you hear what the Lord would have you hear during these two days, I invite you to do so now. Please make this conference a time of feasting on messages from the Lord through His servants.”\nThe scriptures link three words powerfully together: faith, hope, charity. The gift of hope is a priceless endowment from God.\nThe word hope is used for many things we want to happen. For example, “I hope it won’t rain,” or “I hope our team wins.” My intent is to speak of our sacred and eternal hopes centered in Jesus Christ and the restored gospel and our “confident expectation[s] of … the promised blessings of righteousness.”\n\n\nOur Hope for Eternal Life\n\nOur hope of eternal life is assured through the grace of Christ and our own choices, allowing us the remarkable blessing of returning to our heavenly home and living forever in peace and happiness with our Heavenly Father, His Beloved Son, our faithful family and precious friends, and the righteous men and women from every continent and every century.\nOn earth we experience joy and sorrow as we are tested and proven. Our victory comes through faith in Jesus Christ as we triumph over our sins, difficulties, temptations, unfairness, and the challenges of this mortal life.\nAs we strengthen our faith in Jesus Christ, we see beyond our struggles to the blessings and promises of eternity. Like a light whose brilliance grows, hope brightens the darkened world, and we see our glorious future.\n\n\n\nHope Comes from God\n\nSince the beginning, our Heavenly Father and His Beloved Son have eagerly blessed the righteous with the precious gift of hope.\nAfter leaving the garden, Adam and Eve were taught by an angel of the promise of Jesus Christ. The gift of hope enlightened their lives. Adam declared, “My eyes are opened, and in this life I shall have joy.” Eve spoke of “the joy of [their] redemption, and the eternal life which God giveth unto all the obedient.”\nJust as the Holy Ghost brought hope to Adam, the power of the Lord’s Spirit enlightens the faithful today, illuminating the reality of eternal life.\nThe Savior sends us a Comforter, the Holy Ghost, a companion bringing faith, hope, and peace “not as the world giveth.”\n“In the world,” the Savior said, “ye shall have tribulation: but be of good cheer [keep a brightness of hope]; I have overcome the world.”\nIn times of difficulty, we choose to trust the Lord in faith. We quietly pray, “Not my will but thine be done.” We feel the Lord’s approval for our meek willingness, and we await the promised peace the Lord will send in His chosen timing.\nThe Apostle Paul taught, “The God of hope [will] fill you with … joy and peace … , that ye may abound in hope,” “rejoicing in hope; patient in tribulation;” “through the power of the Holy Ghost.”\n\n\n\nA Lesson of Hope\n\nThe prophet Moroni knew firsthand about having hope in Christ during tribulation. He explained his harrowing situation:\n“I am alone. … I have not … whither to go.”\n“I make not myself known … lest they should destroy me.”\nRemarkably, in this dark and lonely hour, Moroni records his father’s words of hope:\n“If a man have faith he must needs have hope; for without faith there cannot be any hope.”\n“What is it that ye shall hope for? … Ye shall have hope through the atonement of Christ and the power of his resurrection, to be raised unto life eternal.”\nMy brothers and sisters, hope is a living gift, a gift that grows as we increase our faith in Jesus Christ. “Faith is the substance of things hoped for.” We build this substance—the evidence blocks of our faith—through prayer, temple covenants, keeping the commandments, continually feasting on the scriptures and the words of modern-day prophets, taking the sacrament, serving others, and worshipping weekly with our fellow Saints.\n\n\n\nA House of Hope\n\nTo fortify our hope in a time of increasing wickedness, the Lord has directed His prophet to dot the earth with His temples.\nAs we enter the Lord’s house, we feel the Spirit of God, verifying our hope.\nThe temple testifies of the empty tomb and that life beyond the veil continues for all.\nFor those who do not have an eternal companion, the ordinances powerfully confirm that every righteous person will receive every promised blessing.\nThere is sublime hope as a young couple kneels across the altar to be sealed, not just for time but for eternity.\nThere is an immensity of hope for us in the promises made to our posterity, whatever their current circumstances.\nThere is no pain, no sickness, no injustice, no suffering, nothing that can darken our hope as we believe and hold tightly to our covenants with God in the house of the Lord. It is a house of light, a house of hope.\n\n\n\nWhen Hope Is Discarded\n\nWe shed tears of sorrow as we see the sadness and despair in those who have no hope in Christ.\nI recently observed from a distance a couple who at one time had faith in Christ but then decided to discard their belief. They were successful in the world, and they found pleasure in their intellect and the rejection of their faith.\nAll seemed well until the husband, still young and energetic, suddenly fell ill and died. Like an eclipse of the sun, they had blocked the light of the Son, and the result was an eclipse of hope. The wife, in her disbelief, now felt disoriented, painfully unprepared, unable to comfort her children. Her intellect had told her that her life was in perfect order until suddenly she could see no tomorrow. Her despair brought darkness and confusion.\n\n\n\nHope in Heartbreaking Tragedy\n\nLet me contrast her painful despair with another family’s hope in Christ during a heartbreaking time.\nTwenty-one years ago the newborn son of my nephew Ben Andersen and his wife, Robbie, was life-flighted from their Idaho farming community to Salt Lake City. I arrived at the hospital, and Ben explained the severe, life-threatening complications with their baby’s heart. We placed our hands on Trey’s tiny head. The Lord blessed him with continued life.\nTrey had heart surgery the first week of his life, and more surgeries followed. As the years passed, it became apparent that Trey would need a heart transplant. Although his physical activities were limited, his faith expanded. He wrote, “I have never felt sorry for myself because I have always known the importance of having faith in Jesus Christ and a testimony of the plan of salvation.”\n  ImageTrey Andersen\nTrey kept on his phone this well-known quote from President Nelson: “The joy we feel has little to do with the circumstances of our lives and everything to do with the focus of our lives.”\n  ImageTrey Andersen\nTrey wrote: “I have always looked forward to serving a full-time mission, but … my doctors won’t let me serve a mission until at least a year after my transplant. … I’ve put my faith in Jesus Christ.”\nTrey was excited at being accepted into the accounting major at BYU beginning this semester, but even more excited in late July when he received the very anticipated telephone call to come to the hospital for his heart transplant.\n“One year,” Trey said, “and I will be on my mission.”\nThere were great expectations as he entered the operating room. However, during the surgery there were devastating complications, and Trey never regained consciousness.\nHis mother, Robbie, said: “Friday had been the most heartbreaking day … just trying to wrap our minds around it. … I had stayed up late just trying to process everything. … But Saturday, I woke up with a feeling of absolute joy. It wasn’t just peace; it wasn’t denial. I felt joy for my son, and I felt joy as his mother. … Ben had gotten up a lot earlier than me, and when we finally got a chance to talk, Ben had awakened with the exact same feeling.”\n  ImageRobbie and Ben Andersen\nBen explained: “Clarity came to my soul as God taught me through His Holy Spirit. I awoke at 4:00 a.m. and was filled with indescribable peace and joy. How is this possible? … The passing of Trey is so very painful, and I miss him so much. But the Lord does not leave us comfortless. … I look forward to a joyful reunion.”\n\n\n\nThe Promise of Hope\n\nTrey had noted in his journal these words from President Nelson’s general conference talk: “It doesn’t seem possible to feel joy when your child suffers with an incurable illness or when you lose your job or when your spouse betrays you. Yet that is precisely the joy the Savior offers. His joy is constant, assuring us that our ‘afflictions shall be but a small moment’ [Doctrine and Covenants 121:7] and be consecrated to our gain.”\nBrothers and sisters, the peace you seek may not come as quickly as you desire, but I promise you that as you trust in the Lord, His peace will come.\nMay we nurture our precious faith, pressing forward with a perfect brightness of hope. I testify that our hope is our Savior, Jesus Christ. Through Him, all our righteous dreams will be realized. He is the God of hope—the triumph of hope. He lives and He loves you. In the name of Jesus Christ, amen.\n\n", "link": "https://www.churchofjesuschrist.org/study/general-conference/2024/10/12andersen?lang=eng"}, {"speaker": "President Emily Belle Freeman", "img": "https://www.churchofjesuschrist.org/imgs/6e9fb22b833811ef9b3a0626c361eb5566ff7f77/full/!192%2C/0/default", "title": "Live Up to Your Privileges", "kicker": "Learn how priesthood ordinances and covenant promises will allow God’s power to flow into your life.", "talkText": "\nRecently my husband, Greg, received a diagnosis that would require an intensive surgery and months of chemotherapy. Like many of you who have faced a similar situation, we immediately began praying for heaven’s help and God’s power. The Sunday following Greg’s surgery, the sacrament was delivered to our hospital room.\nOn this occasion, I was the only one taking the sacrament. One piece of bread. One cup of water. At church, my mind often focuses on the delivery system of the sacrament—the preparing, the blessing, and the passing. But on that afternoon, I pondered the gift of God’s power available to me through the sacred ordinance itself and the covenant promise I was making as I took that piece of bread and that cup of water. This was a time when I needed power from heaven. In the midst of great heartache, exhaustion, and uncertainty, I wondered about this gift that would allow me to draw upon the power from Him that I so desperately needed. Partaking of the sacrament would increase my companionship with the Spirit of the Lord, allowing me to draw upon the gift of God’s power, including the ministering of angels and the Savior’s enabling strength to overcome.\nI don’t think I had ever realized with this much clarity before that it’s not only who officiates in the ordinance that matters—what the ordinance and our covenant promise unlock also deserves the focus of our attention. Priesthood ordinances and covenant promises allow God to sanctify us and then work wonders in our lives. But how does this happen?\nFirst, in order for an ordinance to manifest the power of God in our lives, it must be done with authority from the Son of God. The delivery system is important. The Father entrusted Jesus Christ with the keys and authority to oversee the delivery of His priesthood ordinances. Under His direction, within the order of His priesthood, the sons of God have been ordained to stand in place of the Son of God.\nSecond, we don’t just make covenant promises—we must keep them. In many gospel ordinances, we make sacred covenants with God; He promises to bless us as we keep those covenants. Do we realize it is the combination of priesthood ordinances along with the keeping of covenant promises that allows us to draw upon God’s power?\nThat afternoon I wondered if I, a covenant daughter of God, fully understood how to access the gift of God’s power through priesthood ordinances and if I truly recognized how God’s power works within me.\nIn 2019 a prophetic invitation was extended to the women of the Church, teaching us how to draw the Savior’s power into our lives. President Russell M. Nelson invited us to study Doctrine and Covenants 25, a revelation given to Emma Smith in Harmony, Pennsylvania. Accepting that invitation changed my life.\nLast month I had an unexpected opportunity to visit Harmony. There, under the maple trees, the priesthood was restored to Joseph Smith and Oliver Cowdery. Close to those trees is the front door of Joseph and Emma’s home. Across from the fireplace in that home there is a window. I stood at that window and wondered what Emma might have thought as she looked out across the trees.\nIn July of 1830, Emma was 26 years old; she was so young. She was three and a half years into her marriage. She had lost a baby boy—her first. His little grave is just down the lane from her home. As I stood at that window, it was not hard for me to imagine what might have filled her thoughts. Surely she worried about their finances, about the increasing persecution that threatened their safety, about their future. And yet the work of God was everywhere around her. Did she also wonder about her place in the plan, her purpose in His kingdom, and her potential in the eyes of God?\nI think she may have.\nJust across the way, the gift of God’s priesthood authority and keys had been restored to the earth. This was a time when Emma actually needed power from heaven. In the midst of great heartache, exhaustion, and uncertainty, I imagine Emma wondered about this gift of God’s priesthood that could unlock the power from Him that she so desperately needed.\nBut Emma didn’t just stand at that window and wonder.\nWhile the Prophet Joseph was being tutored in keys, offices, ordinances, and how to assist in the service of the priesthood, the Lord Himself, through His prophet, gave a revelation to Emma. Not Nauvoo-Relief-Society-president Emma—this revelation was given to 26-year-old Emma in Harmony. Through revelation, Emma would learn about the inward sanctification and covenant connection that would increase the ability of those priesthood ordinances to work in her life.\nFirst, the Lord reminded Emma of her place in His plan, including who she was and whose she was—a daughter in His kingdom. She was invited to “walk in the paths of virtue,” a path that included ordinances that would unlock God’s power if Emma held on to her covenants.\nSecond, in her season of deep mourning, the Lord gave her purpose. Emma didn’t just have a front-row seat to the Restoration; she was an essential participant in the work taking place. She would be set apart “to expound scriptures, and to exhort the church.” Her time would “be given to writing, and to learning much.” Emma was given a sacred role to help prepare the Saints to worship; their songs unto the Lord would be received as prayers and “answered with a blessing upon their heads.”\nLast, the Lord outlined a process of inward sanctification that would prepare Emma for exaltation. “Except thou do this,” the Lord explained to her, “where I am you cannot come.”\nIf we read section 25 carefully, we discover an important progression taking place. Emma would go from being a daughter in the kingdom to “elect lady” to queen. Aaronic and Melchizedek Priesthood ordinances, combined with the keeping of her covenant promises, would increase her companionship with the Spirit and with angels, empowering her to navigate her life with divine guidance. Through His divine power, God would heal her heart, enlarge her capacity, and transform her into the version of herself He knew she could become. And through the ordinances of the Melchizedek Priesthood, “the power of godliness [would be] manifest” in her life, and the Lord would part the veil so she could receive understanding from Him. This is what it looks like for God’s power to work within us.\nPresident Russell M. Nelson taught:\n“Everything that happened in [Harmony] has profound implications for your lives. The restoration of the priesthood, along with the Lord’s counsel to Emma, can guide and bless each of you. …\n“… Accessing the power of God in your life requires the same things that the Lord instructed Emma and each of [us] to do.”\nThere were important things happening on both sides of that window in Harmony, including the revelation given to the elect lady whom the Lord had called—a revelation that would strengthen, encourage, and instruct Emma Smith, God’s daughter.\nWhen our granddaughter Isabelle was given a name and a blessing, her father blessed her with an understanding of the priesthood; that she would continue to grow in and learn about the blessing it would provide in her life; and that her faith in the priesthood would grow as she continued to grow in understanding.\nIt is not often a little girl is blessed to understand the priesthood and to learn how those priesthood ordinances and covenant promises will help her to access God’s power. But I remembered Emma and thought to myself, Why not? This tiny daughter has the potential to become an elect lady in His kingdom and eventually a queen. Through His priesthood ordinances and the keeping of her covenant promises, God’s power will work in and through her to help her overcome whatever life brings and become the woman God knows she can become. This is something I want each girl in the kingdom to understand.\n“Live up to your privileges.”\nLearn how priesthood ordinances and covenant promises will allow God’s power to flow into your life with greater efficacy, working in and through you, empowering and equipping you to reach your full purpose and potential.\nCarefully study and ponder the Aaronic and the Melchizedek Priesthood ordinances, the covenant promises we make with each, and the power of God we access through those ordinances.\nRemember, it’s not only who officiates in the ordinance that matters; what the ordinance and your covenant promise unlock also deserves the focus of your attention.\nPartaking of the bread and water is a weekly reminder of His power working in you to help you overcome. Wearing the garment of the holy priesthood is a daily reminder of the gift of His power working in you to help you become.\nWe all have access to the gift of God’s power.\nEvery time we partake of the sacrament.\nEvery time we cross the threshold of a temple.\nThis is the highlight of my Sabbath. This is why I cherish my temple recommend.\n“In the ordinances thereof, the power of godliness is manifest.”\nOf this gift I bear witness in the name of Jesus Christ, amen.\n", "link": "https://www.churchofjesuschrist.org/study/general-conference/2024/10/13freeman?lang=eng"}, {"speaker": "Elder Karl D. Hirst", "img": "https://www.churchofjesuschrist.org/imgs/c7655f9d833811ef9b3a0626c361eb550c951c32/full/!192%2C/0/default", "title": "God’s Favourite", "kicker": "Being filled with God’s love shields us in life’s storms but also makes the happy moments happier.", "talkText": "\nBefore I begin, I should tell you that two of my children have passed out whilst speaking at pulpits, and I have never felt more connected to them than in this moment. I’ve got more on my mind than just the trapdoor.\nOur family has six children, who sometimes tease one another that they are the favourite child. Each has different reasons for being preferred. Our love for each of our children is pure and fulfilling and complete. We could not love any one of them any more than another—with each child’s birth came the most beautiful expansion of our love. I most relate to my Heavenly Father’s love for me through the love that I feel for my children.\nAs they each rehearse their claims to be the most loved child, you might have thought that our family had never had an untidy bedroom. The sense of blemishes in the relationship between parent and child is diminished with a focus on love.\nAt some point, perhaps because I can see that we are heading toward an inevitable family riot, I’ll say something like, “OK, you have worn me down, but I am not going to announce it; you know which one of you is my favourite.” My goal is that each one of the six feels victorious and all-out war is avoided—at least until next time!\nIn his Gospel, John describes himself as “the disciple whom Jesus loved,” as if that arrangement were somehow unique. I like to think that this was because John felt so completely loved by Jesus. Nephi gave me a similar sense when he wrote, “I glory in my Jesus.” Of course, the Saviour isn’t Nephi’s any more than He is John’s, and yet the personal nature of Nephi’s relationship with “his” Jesus led him to that tender description.\nIsn’t it wonderful that there are times when we can feel so fully and personally noticed and loved? Nephi can call Him “his” Jesus, and so can we. Our Saviour’s love is the “highest, noblest, strongest kind of love,” and He provides until we are “filled.” Divine love never runs dry, and we are each a cherished favourite. God’s love is where, as circles on a Venn diagram, we all overlap. Whichever parts of us seem different, His love is where we find togetherness.\nIs it any surprise that the greatest commandments are to love God and to love those around us? When I see people showing Christlike love for one another, it feels to me as if that love contains more than just their love; it is love that also has divinity in it. When we love one another in this way, as completely and fully as we can, heaven gets involved too.\nSo if someone we care about seems distant from a sense of divine love, we can follow this pattern—by doing things that bring us closer to God ourselves and then doing things that bring us closer to them—an unspoken beckoning to come to Christ.\nI wish I could sit down with you and ask you what circumstances cause you to feel God’s love. Which verses of scripture, which particular acts of service? Where would you be? What music? In whose company? General conference is a rich place to learn about connecting with heaven’s love.\nBut perhaps you feel a long way from the love of God. Maybe there is a chorus of voices of discouragement and darkness that weighs into your thoughts, messages telling you that you are too wounded and confused, too weak and overlooked, too different or disoriented to warrant heavenly love in any real way. If you hear those ideas, then please hear this: those voices are just wrong. We can confidently disregard brokenness in any way disqualifying us from heavenly love—every time we sing the hymn that reminds us that our beloved and flawless Saviour chose to be “bruised, broken, [and] torn for us,” every time we take broken bread. Surely Jesus removes all shame from the broken. Through His brokenness, He became perfect, and He can make us perfect in spite of our brokenness. Broken, lonely, torn, and bruised He was—and we may feel we are—but separated from the love of God we are not. “Broken people, perfect love,” as the song goes.\nYou might know something secret about yourself that makes you feel unlovable. However right you might be about what you know about yourself, you are wrong to think that you have put yourself beyond the reach of God’s love. We are sometimes cruel and impatient toward ourselves in ways that we could never imagine being toward anyone else. There is much for us to do in this life, but self-loathing and shameful self-condemnation are not on that list. However misshapen we might feel we are, His arms are not shortened. No. They are always long enough to “[reach our] reaching” and embrace each one of us.\nWhen we don’t feel the warmth of divine love, it hasn’t gone away. God’s own words are that “the mountains shall depart, and the hills be removed; but [His] kindness shall not depart from [us].” So, just to be clear, the idea that God has stopped loving should be so far down the list of possible explanations in life that we don’t get to it until after the mountains have left and the hills are gone!\nI really enjoy this symbolism of mountains being evidence of the certainty of God’s love. That powerful symbolism weaves into accounts of those who go to the mountains to receive revelation and Isaiah’s description of “the mountain of the Lord’s house” being “established in the top of the mountains.” The house of the Lord is the home of our most precious covenants and a place for us all to retreat and sink deeply into the evidence of our Father’s love for us. I have also enjoyed the comfort that comes to my soul when I wrap myself more tightly in my baptismal covenant and find someone who is mourning a loss or grieving a disappointment and I try to help them hold and process their feelings. Are these ways that we can become more immersed in the precious covenantal love hesed?\nSo if God’s love does not leave us, why don’t we always feel it? Just to manage your expectations: I don’t know. But being loved is definitely not the same as feeling loved, and I have a few thoughts that might help you as you pursue your answers to that question.\nPerhaps you are wrestling with grief, depression, betrayal, loneliness, disappointment, or other powerful intrusion into your ability to feel God’s love for you. If so, these things can dull or suspend our ability to feel as we might otherwise feel. For a season at least, perhaps you will not be able to feel His love, and knowledge will have to suffice. But I wonder if you could experiment—patiently—with different ways of expressing and receiving divine love. Can you take a step back from whatever is in front of you and maybe another step and another, until you see a wider landscape, wider and wider still if necessary, until you are literally “thinking celestial” because you are looking at the stars and remembering worlds without number and through them their Creator?\nBirdsong, feeling the sun or a breeze or rain on my skin, and times when nature puts my senses in awe of God—each has had a part in providing me with heavenly connection. Perhaps the comfort of faithful friends will help. Maybe music? Or serving? Have you kept a record or journal of times when your connection with God was clearer to you? Perhaps you could invite those you trust to share their sources of divine connection with you as you search for relief and understanding.\nI wonder, if Jesus were to choose a place where you and He could meet, a private place where you would be able to have a singular focus on Him, might He choose your unique place of personal suffering, the place of your deepest need, where no one else can go? Somewhere you feel so lonely that you must truly be all alone but you aren’t quite, a place to which perhaps only He has travelled but actually has already prepared to meet you there when you arrive? If you are waiting for Him to come, might He already be there and within reach?\nIf you do feel filled with love in this season of your life, please try and hold on to it as effectively as a sieve holds water. Splash it everywhere you go. One of the miracles of the divine economy is that when we try to share Jesus’s love, we find ourselves being filled up in a variation of the principle that “whosoever will lose his life for my sake shall find it.”\nBeing filled with God’s love shields us in life’s storms but also makes the happy moments happier—our joyful days, when there is sunshine in the sky, are made even brighter by the sunshine in our souls.\nLet’s become “rooted and grounded” in our Jesus and in His love. Let’s look for and treasure experiences of feeling His love and power in our lives. The joy of the gospel is available to all: not just the happy, not just the downcast. Joy is our purpose, not the gift of our circumstances. We have every good reason to “rejoice and be filled with love towards God and all men.” Let’s get full. In the name of Jesus Christ, amen.\n", "link": "https://www.churchofjesuschrist.org/study/general-conference/2024/10/14hirst?lang=eng"}, {"speaker": "Elder Dale G. Renlund", "img": "https://www.churchofjesuschrist.org/imgs/2c3c1f77833b11ef9b3a0626c361eb55b63860a2/full/!192%2C/0/default", "title": "“This Is My Gospel”—“This Is My Church”", "kicker": "This is the Savior’s gospel, and this is His Church (see 3 Nephi 27:21; Mosiah 26:22; 27:13). The combination of the two is powerful and transformative.", "talkText": "\nFor centuries, black powder was the most powerful explosive available. It could launch cannon balls, but it wasn’t effective for most mining and road construction projects. It was just too weak to shatter rock.\nIn 1846 an Italian chemist named Ascanio Sobrero synthesized a new explosive, nitroglycerin. This oily fluid was at least a thousand times more powerful than black powder. It could easily shatter rock. Unfortunately, nitroglycerin was unstable. If you dropped it from a small height, it’d blow up. If it got too hot, it’d blow up. If it got too cold, it’d blow up. Even placed in a cool, dark room and left alone, it’d eventually blow up. Most countries banned its transportation, and many banned its manufacture.\nIn 1860 a Swedish scientist named Alfred Nobel began trying to stabilize nitroglycerin. After seven years of experimentation, he achieved his goal by absorbing nitroglycerin into a nearly worthless substance known as diatomaceous earth, or kieselguhr. Kieselguhr is a porous rock that can be crumbled into a fine powder. When mixed with nitroglycerin, kieselguhr absorbs the nitroglycerin, and the resultant paste can be shaped into “sticks.” In this form, nitroglycerin was much more stable. It could be safely stored, transported, and used with undiminished explosive power. Nobel named the combination of nitroglycerin and kieselguhr “dynamite.”\nDynamite changed the world. It also made Nobel wealthy. Without a stabilizer, nitroglycerin was just too hazardous to be commercially valuable, as Ascanio Sobrero found out. By itself, as I mentioned, kieselguhr was of little value. But the combination of the two components made dynamite transformative and precious.\nIn a similar way, the combination of the gospel of Jesus Christ and The Church of Jesus Christ of Latter-day Saints provides powerful and transformative benefits for us. The gospel is perfect, but a divinely commissioned church is required to preach it, maintain its purity, and administer its sacred ordinances with the Savior’s power and authority.\nConsider the combination of the Savior’s gospel and His Church as established by the Book of Mormon prophet Alma. The Church was responsible for preaching “nothing save it were repentance and faith on the Lord, who [would redeem] his people.” Using God’s authority, the Church was responsible for administering the ordinance of baptism “in the name of the Lord, as a witness [of entering] into a covenant with him [to] serve him and keep his commandments.” The people who were baptized took on themselves the name of Jesus Christ, joined His Church, and were promised great power through an outpouring of the Spirit.\nPeople flocked to the Waters of Mormon to hear Alma preach the gospel. Though they revered those waters and the surrounding forests, the Lord’s Church was not a location or a building, nor is it today. The Church is simply ordinary people, disciples of Jesus Christ, gathered and organized into a divinely appointed structure that helps the Lord accomplish His purposes. The Church is the instrument through which we learn the central role of Jesus Christ in Heavenly Father’s plan. The Church offers the authoritative way for individuals to participate in ordinances and make lasting covenants with God. Keeping those covenants draws us closer to God, gives us access to His power, and transforms us into who He intends us to become.\nJust as dynamite without nitroglycerin is unremarkable, the Savior’s Church is special only if it is built on His gospel. Without the Savior’s gospel and the authority to administer the ordinances thereof, the Church isn’t exceptional.\nWithout the stabilizing effect of kieselguhr, nitroglycerin had limited value as an explosive. As history has shown, without the Lord’s Church, humanity’s understanding of His gospel was likewise unstable—prone to doctrinal drift and subject to the influence of different religions, cultures, and philosophies. An amalgamation of those influences has been manifested in every dispensation leading up to this last one. Though the gospel was initially revealed in its purity, the interpretation and application of that gospel gradually took on a form of godliness that lacked power because the divinely authorized framework was absent.\nThe Church of Jesus Christ of Latter-day Saints enables access to God’s power because it is authorized by Him both to teach the doctrine of Christ and to offer the gospel’s saving and exalting ordinances. The Savior yearns to forgive our sins, help us access His power, and transform us. He suffered for our sins and longs to pardon us from the punishment that we otherwise would deserve. He wants us to become holy and be perfected in Him.\nJesus Christ has the power to do this. He didn’t simply sympathize with our imperfections and lament our eternal condemnation in consequence of sin. No, He went beyond that, infinitely beyond that, and restored His Church to enable access to His power.\nThe core of the gospel that the Church teaches is that Jesus Christ bore “our griefs, and carried our sorrows.” He had “laid on him the iniquity of us all.” He “endured the cross,” broke “the bands of death,” “ascended into heaven, and … sat down on the right hand of God, to claim of the Father his rights of mercy.” The Savior did all this because He loves His Father and He loves us. He has already paid the infinite price so He can “[claim] all those who have faith in him [and advocate]” for them—for us. Jesus Christ wants nothing more than for us to repent and come unto Him so that He can justify and sanctify us. In this desire, He is relentless and unwavering.\nThe access to God’s covenantal power and His covenantal love is through His Church. The combination of the Savior’s gospel and His Church transforms our lives. It transformed my maternal grandparents. My grandfather Oskar Andersson worked in a shipyard on Högmarsö, an island in the Stockholm archipelago. His wife, Albertina, and their children lived on the Swedish mainland. Once every two weeks, on Saturday, Oskar rowed his boat home for the weekend before returning to Högmarsö on Sunday evening. One day, while on Högmarsö, he heard two American missionaries preach the restored gospel of Jesus Christ. Oskar felt that what he heard was pure truth, and he was filled with unspeakable joy.\nThe next time he returned home, Oskar excitedly told Albertina all about the missionaries. He explained that he believed what they taught. He asked her to read the pamphlets they had given him, and he told her that he didn’t think that any of their future children should be baptized as infants. Albertina was furious and threw the pamphlets on the rubbish heap. Not much was said between them before Oskar returned to work on Sunday evening.\nAs soon as he was gone, Albertina retrieved those pamphlets. She carefully compared their doctrine with the teachings in her well-worn Bible. She was astonished to feel that what she read was true. The next time Oskar returned home, he received a warm welcome, as did the copy of the Book of Mormon he brought with him. Albertina eagerly read, again comparing the doctrine to that in her Bible. Like Oskar, she recognized pure truth and was filled with unspeakable joy.\nOskar, Albertina, and their children moved to Högmarsö to be close to the few Church members there. A week after Oskar and Albertina were baptized in 1916, Oskar was called to be the group leader on Högmarsö. Like many converts, Oskar and Albertina faced criticism because of their new faith. Local farmers refused to sell them milk, so Oskar rowed across the fjord every day to purchase milk from a more tolerant farmer.\nYet during the ensuing years, Church membership on Högmarsö increased, in part because of Albertina’s powerful testimony and burning missionary zeal. When the group became a branch, Oskar was called as the branch president.\nMembers of that Högmarsö branch revered that island. This was their Waters of Mormon. This was where they came to a knowledge of their Redeemer.\nOver the years, as they kept their baptismal covenant, Oskar and Albertina were transformed by the power of Jesus Christ. They longed to make more covenants and receive their temple blessings. To obtain those blessings, they permanently emigrated from their home in Sweden to Salt Lake City in 1949. Oskar had served as the leader of the members on Högmarsö for 33 years.\nThe combination of nitroglycerin and kieselguhr made dynamite valuable; the combination of the gospel of Jesus Christ and His Church is beyond price. Oskar and Albertina heard about the restored gospel because a prophet of God had called, assigned, and sent missionaries to Sweden. By divine commission, missionaries taught the doctrine of Christ and by priesthood authority baptized Oskar and Albertina. As members, Oskar and Albertina continued learning, developing, and serving others. They became Latter-day Saints because they kept the covenants they made.\nThe Savior refers to The Church of Jesus Christ of Latter-day Saints as “my church” because He commissioned it to accomplish His purposes—preaching His gospel, offering His ordinances and covenants, and making it possible for His power to justify and sanctify us. Without His Church, there is no authority, no preaching of revealed truths in His name, no ordinances or covenants, no manifestation of the power of godliness, no transformation into who God wants us to become, and God’s plan for His children is set at naught. The Church in this dispensation is integral to His plan.\nI invite you to commit yourself more fully to the Savior, His gospel, and His Church. As you do so, you will find that the combination of the Savior’s gospel and His Church brings power into your life. This power is far greater than dynamite. It’ll shatter the rocks in your way, transform you into an inheritor in God’s kingdom. And you will be “filled with that joy which is unspeakable and full of glory.” In the name of Jesu
